#include <iostream>
#include <string>
#include <Windows.h>  //Для SetConsoleCP і SetConsoleOutputCP

using namespace std;

bool alhorytm() {
    //Початок
    //Введення двох бітових рядків у вигляді стрічок a та b
    string a, b;
    cout << "Введіть бітовий рядок a: ";
    cin >> a;
    cout << "Введіть бітовий рядок b: ";
    cin >> b;

    //Знаходимо довжину стрічки a
    int n = a.length();

    //Ініціалізація стрічок результатів x, y, z порожніми значеннями
    string x = "", y = "", z = "";

    //Проходимо по кожному біту стрічок a та b
    for (int i = 0; i < n; i++) {
        char c; //змінна для тимчасового збереження результату

        //Обчислюємо c := a[i] OR b[i]
        if (a[i] == '1' || b[i] == '1') { //повне розгалуження для OR
            c = '1';
        }
        else {
            c = '0';
        }
        //Додаємо результат OR до стрічки x
        x += c;

        //Обчислюємо c := a[i] AND b[i]
        if (a[i] == '1' && b[i] == '1') { //повне розгалуження для AND
            c = '1';
        }
        else {
            c = '0';
        }
        //Додаємо результат AND до стрічки y
        y += c;

        //Обчислюємо c := a[i] XOR b[i]
        if ((a[i] == '1' && b[i] == '0') || (a[i] == '0' && b[i] == '1')) { //повне розгалуження для XOR
            c = '1';
        }
        else {
            c = '0';
        }
        //Додаємо результат XOR до стрічки z
        z += c;
    }

    //Виводимо результати
    cout << "Результат OR:  " << x << endl;
    cout << "Результат AND: " << y << endl;
    cout << "Результат XOR: " << z << endl;
    return 0;
}

int main() {
    //Встановлюємо кодування для підтримки українських символів
    SetConsoleCP(1251);        //Для введення
    SetConsoleOutputCP(1251);  //Для виведення

    alhorytm();

    return 0;
}
